### Groupby

In [1]:
import pandas as pd

In [3]:
# data from
ipl_data = {
    "Team": [
        "Riders",
        "Riders",
        "Devils",
        "Devils",
        "Kings",
        "kings",
        "Kings",
        "Kings",
        "Riders",
        "Royals",
        "Royals",
        "Riders",
    ],
    "Rank":[1,2,2,3,3,4,1,1,2,4,1,2],
    "Year":[2014, 2015,2014, 2015,2014, 2015,2016, 2017, 2016, 2014, 2015, 2015],
    "Point":[876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]
}

df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Point
0   Riders     1  2014    876
1   Riders     2  2015    789
2   Devils     2  2014    863
3   Devils     3  2015    673
4    Kings     3  2014    741
5    kings     4  2015    812
6    Kings     1  2016    756
7    Kings     1  2017    788
8   Riders     2  2016    694
9   Royals     4  2014    701
10  Royals     1  2015    804
11  Riders     2  2015    690

In [4]:
df.groupby("Team")["Point"].std()

Team
Devils    134.350288
Kings      24.006943
Riders     88.567771
Royals     72.831998
kings            NaN
Name: Point, dtype: float64

In [5]:
df.groupby("Team")["Point"].sum()

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Point, dtype: int64

In [6]:
df.groupby("Team")["Point"].mean()

Team
Devils    768.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
kings     812.000000
Name: Point, dtype: float64

In [ ]:
# 한 개이상의 column을 묶을 수 있음
df.groupby(['Team', 'Year'])["Point"].sum()